---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.SpaceTagFilter.#ctor
source: html/1316a1eb-f9bc-a60b-240a-1cad85ba1c77.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceTagFilter.#ctor Method

Constructs a filter which matches only spaces.

## Syntax (C#)
```csharp
public SpaceTagFilter()
```